using System;
using System.Linq;
using WebParsingFramework;

namespace Chia.WebParsing.Companies.UtinetRu
{
    internal static class UtinetRuConstants
    {
        public const int Id = 583;

        public const string Name = "UtinetRu";

        public const string SiteUri = "http://utinet.ru/";

        public const string UriMask = "http://{0}.utinet.ru/";

        public static readonly TimeSpan ProxyTimeout = TimeSpan.FromSeconds(5);

        public const bool SupportArticles = true;

        public const bool SupportShopsAvailability = true;

        public const WebPriceType SupportedPriceTypes = WebPriceType.Internet;

        public static readonly UtinetRuCity[] SupportedCities = UtinetRuCity.All.ToArray();

        public static readonly WebSiteMapPath[] ExcludePaths =
            new WebSiteMapPath[]
                {
new WebSiteMapPath("Автотовары","Автоинструмент"),
new WebSiteMapPath("Автотовары","Автооборудование","Автоинверторы"),
new WebSiteMapPath("Автотовары","Автооборудование","Автомобильные аккумуляторы"),
new WebSiteMapPath("Автотовары","Автооборудование","Автомобильные зарядные устройства"),
new WebSiteMapPath("Автотовары","Автооборудование","Автомобильные источники питания"),
new WebSiteMapPath("Автотовары","Автооборудование","Автомобильные компрессоры"),
new WebSiteMapPath("Автотовары","Автооборудование","Домкраты"),
new WebSiteMapPath("Автотовары","Автооборудование","Стенды промывки форсунок"),
new WebSiteMapPath("Автотовары","Автосвет"),
new WebSiteMapPath("Автотовары","Автохимия и автокосметика","Жидкость для омывателя"),
new WebSiteMapPath("Автотовары","Аксессуары","Автомобильные держатели"),
new WebSiteMapPath("Автотовары","Аксессуары","Автомобильные зеркала"),
new WebSiteMapPath("Автотовары","Аксессуары","Автомобильные очки"),
new WebSiteMapPath("Автотовары","Аксессуары","Автомобильные чехлы"),
new WebSiteMapPath("Автотовары","Аксессуары","Брызговики и дефлекторы"),
new WebSiteMapPath("Автотовары","Аксессуары","Разветвители для прикуривателя"),
new WebSiteMapPath("Автотовары","Аксессуары","Чехлы для навигаторов"),
new WebSiteMapPath("Автотовары","Аксессуары","Щетки стеклоочистителя"),
new WebSiteMapPath("Автотовары","Безопасность","Автосигнализации"),
new WebSiteMapPath("Автотовары","Безопасность","Брелоки для сигнализации"),
new WebSiteMapPath("Автотовары","Мототехника","Мотошины"),
new WebSiteMapPath("Автотовары","Мультимедиа","Кабели"),
new WebSiteMapPath("Автотовары","Мультимедиа","Навигационные карты"),
new WebSiteMapPath("Автотовары","Смазочные материалы","Автомобильные масла и смазки"),
new WebSiteMapPath("Автотовары","Шины и Диски","Автомобильные шины"),
new WebSiteMapPath("Автотовары","Шины и Диски","Колесные диски"),
new WebSiteMapPath("Бытовая техника","Aксессуары для дома и бытовой техники","Аксессуары для зубных щеток"),
new WebSiteMapPath("Бытовая техника","Aксессуары для дома и бытовой техники","Аксессуары для кофеварок"),
new WebSiteMapPath("Бытовая техника","Aксессуары для дома и бытовой техники","Аксессуары для кухонных комбайнов"),
new WebSiteMapPath("Бытовая техника","Aксессуары для дома и бытовой техники","Аксессуары для кухонных ножей"),
new WebSiteMapPath("Бытовая техника","Aксессуары для дома и бытовой техники","Аксессуары для маникюрных наборов"),
new WebSiteMapPath("Бытовая техника","Aксессуары для дома и бытовой техники","Аксессуары для микроволновых печей"),
new WebSiteMapPath("Бытовая техника","Aксессуары для дома и бытовой техники","Аксессуары для мультиварок"),
new WebSiteMapPath("Бытовая техника","Aксессуары для дома и бытовой техники","Аксессуары для пылесосов"),
new WebSiteMapPath("Бытовая техника","Aксессуары для дома и бытовой техники","Аксессуары для стиральных машин"),
new WebSiteMapPath("Бытовая техника","Aксессуары для дома и бытовой техники","Аксессуары для холодильников"),
new WebSiteMapPath("Бытовая техника","Aксессуары для дома и бытовой техники","Сиропы"),
new WebSiteMapPath("Бытовая техника","Aксессуары для дома и бытовой техники","Сменные кассеты для фильтров"),
new WebSiteMapPath("Бытовая техника","Бытовая химия","Бытовая химия"),
new WebSiteMapPath("Бытовая техника","Для здоровья и красоты","Сетки для бритв"),
new WebSiteMapPath("Бытовая техника","Климатическая техника","Аромадиффузор"),
new WebSiteMapPath("Бытовая техника","Климатическая техника","Фильтры для воздухоочистителей и увлажнителей"),
new WebSiteMapPath("Бытовая техника","Кухонная техника","Посуда"),
new WebSiteMapPath("Бытовая техника","Кухонная техника","Измельчители пищевых отходов"),
new WebSiteMapPath("Бытовая техника","Кухонная техника","Системы охлаждения и розлива пива"),
new WebSiteMapPath("Бытовая техника","Кухонная техника","Сифоны"),
new WebSiteMapPath("Бытовая техника","Мебель","Корпусная мебель"),
new WebSiteMapPath("Бытовая техника","Мебель","Надувная мебель"),
new WebSiteMapPath("Бытовая техника","Мебель","Складная мебель"),
new WebSiteMapPath("Бытовая техника","Мебель","Фурнитура"),
new WebSiteMapPath("Бытовая техника","Мелкая бытовая техника","Гладильные доски"),
new WebSiteMapPath("Бытовая техника","Мелкая бытовая техника","Кулеры для воды"),
new WebSiteMapPath("Бытовая техника","Мелкая бытовая техника","Помпы для воды"),
new WebSiteMapPath("Бытовая техника","Мелкая бытовая техника","Рукомойники"),
new WebSiteMapPath("Бытовая техника","Мелкая бытовая техника","Стационарные часы"),
new WebSiteMapPath("Бытовая техника","Мелкая бытовая техника","Сушилки для белья"),
new WebSiteMapPath("Бытовая техника","Мелкая бытовая техника","Щетки для пылесосов"),
new WebSiteMapPath("Бытовая техника","Прочие категории, не объединённые в подвитрины","Манекены"),
new WebSiteMapPath("Бытовая техника","Текстиль","Матрасы"),
new WebSiteMapPath("Бытовая техника","Текстиль","Полотенца"),
new WebSiteMapPath("Бытовая техника","Текстиль","Постельное белье"),
new WebSiteMapPath("Бытовая техника","Текстиль","Шторы и тюли"),
new WebSiteMapPath("Бытовая техника","Хозяйственные товары","Корзины для белья и мешки для стирки"),
new WebSiteMapPath("Бытовая техника","Хозяйственные товары","Мытье посуды"),
new WebSiteMapPath("Бытовая техника","Хозяйственные товары","Скотч"),
new WebSiteMapPath("Бытовая техника","Хозяйственные товары","Уборка"),
new WebSiteMapPath("Бытовая техника","Хозяйственные товары","Хранение и уход за одеждой и обувью"),
new WebSiteMapPath("Игры и игровые приставки","Игры"),
new WebSiteMapPath("Игры и игровые приставки","Чехлы для приставок"),
new WebSiteMapPath("Комплектующие","Охлаждение","Вентиляторы для ПК"),
new WebSiteMapPath("Комплектующие","Охлаждение","Кулеры для процессора"),
new WebSiteMapPath("Комплектующие","Охлаждение","Системы водяного охлаждения"),
new WebSiteMapPath("Комплектующие","Охлаждение","Термопасты"),
new WebSiteMapPath("Компьютеры","Аксессуары","USB-аксессуары"),
new WebSiteMapPath("Компьютеры","Аксессуары","Автомобильные держатели для планшетов"),
new WebSiteMapPath("Компьютеры","Аксессуары","Замки"),
new WebSiteMapPath("Компьютеры","Аксессуары","Коврики для мышек"),
new WebSiteMapPath("Компьютеры","Аксессуары","Компьютерные очки"),
new WebSiteMapPath("Компьютеры","Аксессуары","Пленки для ноутбуков и планшетов"),
new WebSiteMapPath("Компьютеры","Аксессуары","Стилусы"),
new WebSiteMapPath("Компьютеры","Аксессуары","Уход за цифровой техникой"),
new WebSiteMapPath("Компьютеры","Программное обеспечение","Антивирусные программы"),
new WebSiteMapPath("Компьютеры","Программное обеспечение","Операционные системы"),
new WebSiteMapPath("Компьютеры","Программное обеспечение","Офисные приложения"),
new WebSiteMapPath("Компьютеры","Программное обеспечение","Программы для мультимедиа и графики"),
new WebSiteMapPath("Офисная техника","Коммутационное оборудование","KVM-переключатели"),
new WebSiteMapPath("Офисная техника","Оргтехника","Детекторы и счетчики банкнот"),
new WebSiteMapPath("Офисная техника","Оргтехника","Защитные коврики"),
new WebSiteMapPath("Офисная техника","Оргтехника","Переплетчики"),
new WebSiteMapPath("Офисная техника","Оргтехника","Шредеры"),
new WebSiteMapPath("Офисная техника","Полиграфия","Биговщики"),
new WebSiteMapPath("Офисная техника","Полиграфия","Обрезчики углов"),
new WebSiteMapPath("Офисная техника","Полиграфия","Резаки"),
new WebSiteMapPath("Офисная техника","Полиграфия","Рулонные ламинаторы"),
new WebSiteMapPath("Офисная техника","Полиграфия","Термоклеевые машины"),
new WebSiteMapPath("Офисная техника","Полиграфия","Термопрессы"),
new WebSiteMapPath("Офисная техника","Расходные материалы","Обложки для бумаг"),
new WebSiteMapPath("Офисная техника","Расходные материалы","Пленки для ламинирования"),
new WebSiteMapPath("Офисная техника","Расходные материалы","Пружины для переплетчиков"),
new WebSiteMapPath("Офисная техника","Столы, стулья, шкафы","Офисная мебель"),
new WebSiteMapPath("Офисная техника","Телефония","Опции для АТС"),
new WebSiteMapPath("Офисная техника","Техника для рабочих мест","Обучающие программы"),
new WebSiteMapPath("Проекционная техника","Аксессуары и комплектующие","Воздушные фильтры"),
new WebSiteMapPath("Проекционная техника","Аксессуары и комплектующие","Кабели"),
new WebSiteMapPath("Проекционная техника","Аксессуары и комплектующие","Лазерные указки"),
new WebSiteMapPath("Проекционная техника","Аксессуары и комплектующие","Лампы для проекторов"),
new WebSiteMapPath("Проекционная техника","Аксессуары и комплектующие","Модули Wi-Fi"),
new WebSiteMapPath("Проекционная техника","Аксессуары и комплектующие","Объективы для проекторов"),
new WebSiteMapPath("Проекционная техника","Аксессуары и комплектующие","Системы дистанционного управления"),
new WebSiteMapPath("Проекционная техника","Аксессуары и комплектующие","Стилусы для интерактивных досок"),
new WebSiteMapPath("Проекционная техника","Крепления и мебель","Кафедры"),
new WebSiteMapPath("Проекционная техника","Крепления и мебель","Кронштейны для проекторов"),
new WebSiteMapPath("Проекционная техника","Крепления и мебель","Лифтовые системы"),
new WebSiteMapPath("Проекционная техника","Крепления и мебель","Проекционные столики"),
new WebSiteMapPath("Теле-видео-аудио тех­ника","Аксессуары","Подставки для ТВ"),
new WebSiteMapPath("Телефоны","Автомобильные держатели"),
new WebSiteMapPath("Телефоны","Защитные пленки"),
new WebSiteMapPath("Телефоны","Карты оплаты"),
new WebSiteMapPath("Телефоны","Комплектующие для телефонов"),
new WebSiteMapPath("Телефоны","Подставки для телефонов"),
new WebSiteMapPath("Телефоны","Стилусы"),
new WebSiteMapPath("Телефоны","Тарифные планы"),
new WebSiteMapPath("Телефоны","Шнурки и брелоки"),
new WebSiteMapPath("Цифровая техника","Аксессуары","Аксессуары для оптики"),
new WebSiteMapPath("Цифровая техника","Портативная техника и гаджеты","Наручные часы"),
new WebSiteMapPath("Цифровая техника","Портативная техника и гаджеты","Спортивные часы"),
new WebSiteMapPath("Цифровая техника","Цифровая фото- и видеотехника","Бленды"),
new WebSiteMapPath("Цифровая техника","Цифровая фото- и видеотехника","Защитные крышки"),
new WebSiteMapPath("Цифровая техника","Цифровая фото- и видеотехника","Конвертеры для объективов"),
new WebSiteMapPath("Цифровая техника","Цифровая фото- и видеотехника","Светофильтры"),
                };

        public static readonly string[] ExcludeKeywords =
            new[]
                {
                    "Электроинструменты",
                    "Детские товары",
                    "Ремонт и обустройство",
                    "Сад и огород",
                    "Спорт и туризм",
                    "Подарки и сувениры",
                    "Круглосуточная распродажа"
                };
    }
}