using System;
using System.Linq;
using WebParsingFramework;

namespace Chia.WebParsing.Companies.TechportRu
{
    internal static class TechportRuConstants
    {
        public const int Id = 614;

        public const string Name = "Techport.Ru";

        public const string SiteUri = "http://www.techport.ru/";

        public static readonly TimeSpan ProxyTimeout = TimeSpan.FromSeconds(5);

        public const bool SupportArticles = true;

        public const bool SupportShopsAvailability = false;

        public const WebPriceType SupportedPriceTypes = WebPriceType.Internet;

        public static readonly TechportRuCity[] SupportedCities = TechportRuCity.All.ToArray();

        public static readonly WebSiteMapPath[] ExcludePaths =
            new[]
                {
new WebSiteMapPath("Hi-Fi и аудиотехника","Оборудование для диджеев","DJ контроллеры"),
new WebSiteMapPath("Hi-Fi и аудиотехника","Оборудование для диджеев","DJ микшеры, пульты"),
new WebSiteMapPath("Hi-Fi и аудиотехника","Оборудование для диджеев","Аксессуары для DJ оборудования"),
new WebSiteMapPath("Авто-Мото","Автозвук и видео","Переходные рамки"),
new WebSiteMapPath("Авто-Мото","Аксессуары для авто","Автокомпрессоры"),
new WebSiteMapPath("Авто-Мото","Аксессуары для авто","Аксессуары для автокресел"),
new WebSiteMapPath("Авто-Мото","Аксессуары для авто","Багажники для автомобилей"),
new WebSiteMapPath("Авто-Мото","Аксессуары для авто","В помощь водителю"),
new WebSiteMapPath("Авто-Мото","Аксессуары для авто","Массажные кресла"),
new WebSiteMapPath("Авто-Мото","Аксессуары для авто","Мобильные кухни"),
new WebSiteMapPath("Авто-Мото","Аксессуары для авто","Секретки для дисков"),
new WebSiteMapPath("Авто-Мото","Все для автомобиля","Автохимия"),
new WebSiteMapPath("Авто-Мото","Все для автомобиля","Уход за автомобилем","Автокосметика"),
new WebSiteMapPath("Авто-Мото","Все для автомобиля","Уход за автомобилем","Автомобильные масла"),
new WebSiteMapPath("Авто-Мото","Все для автомобиля","Уход за автомобилем","Аксессуары для минимоек"),
new WebSiteMapPath("Авто-Мото","Мототехника","Аксессуары для мототехники","Грипсы"),
new WebSiteMapPath("Авто-Мото","Мототехника","Аксессуары для мототехники","Демпферы рулевые"),
new WebSiteMapPath("Авто-Мото","Мототехника","Аксессуары для мототехники","Дуги защитные"),
new WebSiteMapPath("Авто-Мото","Мототехника","Аксессуары для мототехники","Замки и цепи"),
new WebSiteMapPath("Авто-Мото","Мототехника","Аксессуары для мототехники","Запчасти"),
new WebSiteMapPath("Авто-Мото","Мототехника","Аксессуары для мототехники","Защита для ATV"),
new WebSiteMapPath("Авто-Мото","Мототехника","Аксессуары для мототехники","Зеркала"),
new WebSiteMapPath("Авто-Мото","Мототехника","Аксессуары для мототехники","Канистры для ATV"),
new WebSiteMapPath("Авто-Мото","Мототехника","Аксессуары для мототехники","Комплекты гусениц"),
new WebSiteMapPath("Авто-Мото","Мототехника","Аксессуары для мототехники","Кофры и сумки"),
new WebSiteMapPath("Авто-Мото","Мототехника","Аксессуары для мототехники","Лебёдки для квадроциклов"),
new WebSiteMapPath("Авто-Мото","Мототехника","Аксессуары для мототехники","Отвалы снегоуборочные ATV"),
new WebSiteMapPath("Авто-Мото","Мототехника","Аксессуары для мототехники","Подкаты для мототехники"),
new WebSiteMapPath("Авто-Мото","Мототехника","Аксессуары для мототехники","Противоугонные устройства"),
new WebSiteMapPath("Авто-Мото","Мототехника","Аксессуары для мототехники","Стёкла ветровые"),
new WebSiteMapPath("Авто-Мото","Мототехника","Аксессуары для мототехники","Тенты и кабины для ATV"),
new WebSiteMapPath("Авто-Мото","Мототехника","Аксессуары для мототехники","Чехлы для мототехники"),
new WebSiteMapPath("Авто-Мото","МотоТехника","Гидроциклы"),
new WebSiteMapPath("Авто-Мото","МотоТехника","Квадроциклы и мотовездеходы"),
new WebSiteMapPath("Авто-Мото","МотоТехника","Мотоциклы"),
new WebSiteMapPath("Авто-Мото","МотоТехника","Скутеры и мопеды"),
new WebSiteMapPath("Авто-Мото","МотоТехника","Снегоходы"),
new WebSiteMapPath("Авто-Мото","Преобразователи тока"),
new WebSiteMapPath("Авто-Мото","Экипировка"),
new WebSiteMapPath("Климатическое оборудование","Кондиционеры","Аксессуары"),
new WebSiteMapPath("Компьютерная и оргтехника","Аксессуары для компьютерной техники","Коврики для мыши"),
new WebSiteMapPath("Компьютерная и оргтехника","Аксессуары для компьютерной техники","Чистящие средства"),
new WebSiteMapPath("Компьютерная и оргтехника","Источники бесперебойного питания","Опции для монтажа"),
new WebSiteMapPath("Компьютерная и оргтехника","Ноутбуки","Аксессуары к ноутбукам","Опции и принадлежности"),
new WebSiteMapPath("Компьютерная и оргтехника","Оргтехника и расходные материалы","Переплетчики"),
new WebSiteMapPath("Компьютерная и оргтехника","Оргтехника и расходные материалы","Резаки"),
new WebSiteMapPath("Компьютерная и оргтехника","Оргтехника и расходные материалы","Шредеры"),
new WebSiteMapPath("Компьютерная и оргтехника","Сетевое оборудование","Опции"),
new WebSiteMapPath("Красота и здоровье","Здоровье","Контактные линзы"),
new WebSiteMapPath("Красота и здоровье","Здоровье","Косметические средства"),
new WebSiteMapPath("Красота и здоровье","Здоровье","Массажеры для тела","Пояса для похудения"),
new WebSiteMapPath("Красота и здоровье","Здоровье","Растворы для линз"),
new WebSiteMapPath("Красота и здоровье","Здоровье","Средства для маникюра и педикюра"),
new WebSiteMapPath("Красота и здоровье","Индивидуальный уход","Аксессуары для бритв"),
new WebSiteMapPath("Красота и здоровье","Индивидуальный уход","Аксессуары для зубных щеток"),
new WebSiteMapPath("Крупная бытовая техника","Стиральные машины","Аксессуары"),
new WebSiteMapPath("Мелкая бытовая техника","Гладильные доски"),
new WebSiteMapPath("Мелкая бытовая техника","Мелкие кухонные приборы","Аксессуары для блендеров"),
new WebSiteMapPath("Мелкая бытовая техника","Мелкие кухонные приборы","Аксессуары для кухонных комбайнов"),
new WebSiteMapPath("Мелкая бытовая техника","Мелкие кухонные приборы","Аксессуары для миксеров"),
new WebSiteMapPath("Мелкая бытовая техника","Мелкие кухонные приборы","Механические терки"),
new WebSiteMapPath("Мелкая бытовая техника","Пылесосы","Аксессуары"),
new WebSiteMapPath("Мелкая бытовая техника","Сушилки для белья"),
new WebSiteMapPath("Мелкая бытовая техника","Техника для кухни","Кофеварки и кофемашины","Кофе"),
new WebSiteMapPath("Мелкая бытовая техника","Техника для кухни","Микроволновые печи","Аксессуары"),
new WebSiteMapPath("Проекторы и интерактивные доски","Аксессуары для проекторов"),
new WebSiteMapPath("Проекторы и интерактивные доски","Лампы для проекторов"),
new WebSiteMapPath("Телевизоры и видеотехника","Аксессуары для телевизоров и видео","Чистящие средства для экранов"),
new WebSiteMapPath("Телевизоры и видеотехника","Приставки и Игры"),
new WebSiteMapPath("Телевизоры и видеотехника","Тумбы под телевизор"),
new WebSiteMapPath("Телефония","Дополнительное оборудование для АТС"),
new WebSiteMapPath("Телефония","Системные телефоны"),
new WebSiteMapPath("Телефония","Телефонные АТС"),
new WebSiteMapPath("Фото и видеокамеры","Аксессуары к фото-видео технике","Аксессуары для фотовспышек"),
new WebSiteMapPath("Фото и видеокамеры","Аксессуары к фото-видео технике","Бленды"),
new WebSiteMapPath("Фото и видеокамеры","Аксессуары к фото-видео технике","Конвертеры"),
new WebSiteMapPath("Фото и видеокамеры","Аксессуары к фото-видео технике","Линзы"),
new WebSiteMapPath("Фото и видеокамеры","Аксессуары к фото-видео технике","Насадки и крышки на объективы"),
new WebSiteMapPath("Фото и видеокамеры","Аксессуары к фото-видео технике","Светофильтры"),
new WebSiteMapPath("Фото и видеокамеры","Аксессуары к фото-видео технике","Средства для ухода за оптикой и LCD-дисплеями"),
new WebSiteMapPath("Швейная техника","Аксессуары для шитья"),
new WebSiteMapPath("Швейная техника","Аксессуары для шитья","Иглы для бытовых оверлоков"),
new WebSiteMapPath("Швейная техника","Аксессуары для шитья","Иглы для бытовых швейных машин"),
new WebSiteMapPath("Швейная техника","Аксессуары для шитья","Коврики"),
new WebSiteMapPath("Швейная техника","Аксессуары для шитья","Лапки к бытовым швейным машинам"),
new WebSiteMapPath("Швейная техника","Аксессуары для шитья","Масло машинное"),
new WebSiteMapPath("Швейная техника","Аксессуары для шитья","Нитки"),
new WebSiteMapPath("Швейная техника","Аксессуары для шитья","Ножницы"),
new WebSiteMapPath("Швейная техника","Аксессуары для шитья","Прочее"),
new WebSiteMapPath("Швейная техника","Аксессуары для шитья","Столики"),
new WebSiteMapPath("Швейная техника","Аксессуары для шитья","Сумки и кейсы"),
new WebSiteMapPath("Швейная техника","Аксессуары для шитья","Шпульки"),
new WebSiteMapPath("Швейная техника","Портновские манекены"),
                };

        public static readonly string[] ExcludeKeywords =
            new[]
                {
                    "Строительство и ремонт",
                    "Спортивные товары",
                    "Дача, сад и парк",
                    "Садовая техника",
                    "Сантехника",
                    "Все для детей",
                    "Игрушки",
                    "Школьные принадлежности",
                    "Посуда",
                    "Подарки и сувениры",
                    "Туризм и активный отдых",
                    "Товары для дома",
                    "Сертификаты уверенности",
                    "Уцененные товары",
                    "Аксессуары для бытовой техники"
                };
    }
}